/*
Створити функцію RingS(R1, R2) дійсного типу,

	 що обчислює площу кільця, яке розташовано між двома
	  колами зі спільним центром та радіусами
	   R1 та R2 (R1 та R2 — дійсні числа, R2 > R1).
	    З її допомогою знайти площу кільця,
		 для якого дано зовнішні та внутрішні
		 	 радіуси R2=10, R5=5.

/ Для значення π використовувати 3.14.
*/
package main

import (
	"fmt"
	"math"
)

func RingS(R1 float64, R2 float64) float64 {
	S1 := 3.14 * math.Pow(R1, 2)
	S2 := 3.14 * math.Pow(R2, 2)
	return S2 - S1
}
func main() {
	square := RingS(5, 10)
	fmt.Println(square)

}
