/*
1. Реалізуйте програму, яка визначає, чи в нормі
маса тіла у людини.

	Вага людини в кілограмах в нормі повинна дорівнювати

величині її росту в сантиметрах мінус 100 +/-10%.
Якщо зріст більше, ніж на 10%
, то потрібно вивести «треба поправитися».
Якщо вага більше, ніж на 10% , то
потрібно вивести «треба схуднути». Якщо  в нормі, то "норма".
*/
package main

import "fmt"

func main() {
	zrist := 180
	vaga := 100
	if zrist-vaga < 100*1.11 || zrist-vaga < 100-(100*0.1) {
		fmt.Println("shud")
	}
	if zrist-vaga > 100 {
		fmt.Println("Popr")
	}
	if zrist-vaga == 100 {
		fmt.Println("norm")
	}
}
